:PROPERTIES:
:ID: D6C9B1A7-E6AB-4847-9DB8-65DDAEE9C5C2
:END:
#+title: Get
#+description: Get
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:change_reason_categories:
#+created: 2026-05-21
#+updated: 2026-05-21

Get all change reason categories in the system.

#+name: change-reason-categories-get
#+begin_src ores-shell :exports none
change-reason-categories get
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<change-reason-categories-get>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell>
+--------+-------------------------------------------------------------------------+-------------+---------+
| Code   | Description                                                             | Recorded By | Version |
+--------+-------------------------------------------------------------------------+-------------+---------+
| common | Universal data quality reasons aligned with BCBS 239 and FRTB standards | system      | 1       |
| system | System-generated reasons for automatic operations (not user-selectable) | system      | 1       |
| trade  | Trade lifecycle reasons aligned with FINRA and MiFID II standards. test | newuser3    | 7       |
+--------+-------------------------------------------------------------------------+-------------+---------+


ores-shell> Bye!
#+end_example
